# GetNormal Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..GetNormal Method
Mesh Class See Also
---
Returns a normal unit vector at the given index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public XYZ GetNormal(
	int idx
)
```

Visual Basic
---
```text
Public Function GetNormal ( _
	idx As Integer _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetNormal(
	int idx
)
```

# ### Parameters
idx
    Type: System..::..Int32 A zero-based index. It must be consistent with the DistributionOfNormals.
# ### Return Value
XYZ value representing a normal unit vector.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value is not a valid index of a normal of the mesh. A valid value is not negative and is smaller than the number of normals in the mesh. |

# See Also
Mesh Class
Autodesk.Revit.DB Namespace